espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/wisun/component/iperf/sl_iperf_util.c
/***************************************************************************//**
 * @file
 * @brief
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

// -----------------------------------------------------------------------------
//                                   Includes
// -----------------------------------------------------------------------------

#include <stdio.h>
#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include "sl_iperf_util.h"
#include "sl_iperf_config.h"
#include "sl_iperf_log.h"

// -----------------------------------------------------------------------------
//                              Macros and Typedefs
// -----------------------------------------------------------------------------

/// Define not valid string for outputs
#define SL_IPERF_LOG_NOT_VALID_STR              "N/A"

/// iPerf UDP Server report header
#define SL_IPERF_SERVER_REPORT_HEADER \
  " Interval       Transfer       Bandwidth        Jitter   Lost/Total Datagrams\n"

/// UDP Server statistic format
#define SL_IPERF_UDP_SRV_STATISTIC_FORMAT_STR \
  " %lu.%.2lu-%lu.%.2lu sec  %lu.%u%u%u %-7s  %lu.%u%u%u %-10s %lu ms    %lu/%lu (%u%%)\n"

/// UDP Server statistic format
#define SL_IPERF_UDP_SRV_OUT_OF_ORDER_STAT_FORMAT_STR \
  " %lu.%.2lu-%lu.%.2lu sec  %lu datagrams received out-of-order\n"

/// iPerf UDP Server report header
#define SL_IPERF_CLIENT_REPORT_HEADER \
  " Interval       Transfer       Bandwidth\n"

/// UDP Client statistic format
#define SL_IPERF_UDP_CLNT_STATISTIC_FORMAT_STR \
  " %lu.%.2lu-%lu.%.2lu sec  %lu.%u%u%u %-7s  %lu.%u%u%u %-10s\n"

#define SL_IPERF_UDP_SRV_CONNECTION_FORMAT_STR \
  " local %s port %u connected with %s port %u\n"

///
#define SL_IPERF_UDP_CLNT_CONNECTION_FORMAT_STR \
  " local %s connected with %s port %u\n"

/// Create json indent macro function
#define __indent(__val)                         _calc_ind(__val), ""

/// Integer 32 bit converter union definition
typedef union i32_converter {
  /// Integer value
  int32_t i32val;
  /// Byte values
  uint8_t bytes[4U];
} i32_converter_t;

/// Integer 16 bit converter union definition
typedef union i16_converter {
  /// Integer value
  int16_t i16val;
  /// Byte values
  uint8_t bytes[2U];
} i16_converter_t;

/// Integer representation of floating point numbers
typedef struct ifloat {
  /// Integer part
  uint32_t int_val;
  /// Fractional part digit0
  uint8_t f0_val;
  /// Fractional part digit1
  uint8_t f1_val;
  /// Fractional part digit2
  uint8_t f2_val;
} ifloat_t;

/// Status update parameters/variables
typedef struct stat_update_params {
  /// Delta time
  sl_iperf_ts_ms_t ts_ms_delta;
  /// Current time
  sl_iperf_ts_ms_t ts_ms_cur;
  /// Start time
  sl_iperf_time_t start_time;
  /// End time
  sl_iperf_time_t end_time;
  /// Delta bytes
  size_t data_bytes_delta;
  /// Current bytes
  size_t data_bytes_cur;
  /// Current lost packets
  uint32_t lost_pkt_curr;
  /// Formatted value of bandwidth
  ifloat_t fval_bw;
  /// Formatted= value of data
  ifloat_t fval_data;
  /// Current packet count
  uint32_t pkt_cnt;
  /// Current Out-of-order packet count
  uint32_t out_of_order_pkt_cnt;
} stat_update_params_t;

// -----------------------------------------------------------------------------
//                          Static Function Declarations
// -----------------------------------------------------------------------------

/**************************************************************************//**
 * @brief Convert bool int to json bool
 * @details helper function
 * @param[in] val Value
 * @return const char* String json value
 *****************************************************************************/
static inline const char * _bool_to_json(const bool val);

/**************************************************************************//**
 * @brief Calculate json indent
 * @details Helper function
 * @param[in] val Indent value
 * @return uint8_t Space count
 *****************************************************************************/
static inline uint8_t _calc_ind(const uint8_t val);

/**************************************************************************//**
 * @brief Calculate formatted bandwidth
 * @details Helper function
 * @param[in] bw_format Bandwidth format/unit
 * @param[in] bytes Bytes
 * @param[in] time_ms Time ms
 * @param[out] dst Destination ptr
 *****************************************************************************/
static void _calculate_formatted_bw(const sl_iperf_opt_bw_format bw_format,
                                    const uint32_t bytes,
                                    const uint32_t time_ms,
                                    ifloat_t * const dst);

/**************************************************************************//**
 * @brief Convert data
 * @details Helper function
 * @param[in] amount Amount of data
 * @param[in] divider Divider, like 1024 or 1000
 * @param[out] dst Destination ptr
 *****************************************************************************/
static void _data_converter(const uint32_t amount, const uint32_t divider, ifloat_t * const dst);

/**************************************************************************//**
 * @brief Print UDP server status report
 * @details Helper function
 * @param[in,out] test Test descriptor
 * @param[in] params Parameters
 *****************************************************************************/
static void _print_udp_srv_status(sl_iperf_test_t * const test,
                                  const stat_update_params_t * const params);

/**************************************************************************//**
 * @brief Print UDP client status report
 * @details Helper function
 * @param[in,out] test Test descriptor
 * @param[in] params Parameters
 *****************************************************************************/
static void _print_udp_clnt_status(sl_iperf_test_t * const test,
                                   const stat_update_params_t * const params);
// -----------------------------------------------------------------------------
//                                Static Variables
// -----------------------------------------------------------------------------

