espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/wisun/component/iperf/sl_iperf_util.c
// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------

void sl_iperf_print_test_log_json(sl_iperf_test_t * const test)
{
  if (!sl_iperf_check_test_logger(test)) {
    return;
  }
  sl_iperf_log_print(test->log, "{\n");
  sl_iperf_log_print(test->log, "%*s\"Test-%lu\": {\n", __indent(1U), test->id);
  sl_iperf_log_print(test->log, "%*s\"id\":     %u,\n", __indent(2U), test->id);
  sl_iperf_log_print(test->log, "%*s\"status\": \"%s\",\n", __indent(2U), sl_iperf_test_status_to_str(test->status));
  sl_iperf_log_print(test->log, "%*s\"error\":  \"%s\",\n", __indent(2U), sl_iperf_test_error_to_str(test->err));
  sl_iperf_log_print(test->log, "%*s\"options\": {\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s\"mode\":        \"%s\",\n", __indent(3U), sl_iperf_opt_mode_to_str(test->opt.mode));
  sl_iperf_log_print(test->log, "%*s\"protocol\":    \"%s\",\n", __indent(3U), sl_iperf_opt_protocol_to_str(test->opt.protocol));
  sl_iperf_log_print(test->log, "%*s\"port\":        %u,\n", __indent(3U), test->opt.port);
  sl_iperf_log_print(test->log, "%*s\"remote_addr\": \"%s\",\n", __indent(3U), test->opt.remote_addr);
  sl_iperf_log_print(test->log, "%*s\"bandwidth\":   %lu,\n", __indent(3U), test->opt.bandwidth);
  sl_iperf_log_print(test->log, "%*s\"packet_nbr\":  %u,\n", __indent(3U), test->opt.packet_nbr);
  sl_iperf_log_print(test->log, "%*s\"buf_len\":     %u,\n", __indent(3U), test->opt.buf_len);
  sl_iperf_log_print(test->log, "%*s\"duration_ms\": %u,\n", __indent(3U), test->opt.duration_ms);
  sl_iperf_log_print(test->log, "%*s\"win_size\":    %u,\n", __indent(3U), test->opt.win_size);
  sl_iperf_log_print(test->log, "%*s\"persistent\":  %s,\n", __indent(3U), _bool_to_json(test->opt.persistent));
  sl_iperf_log_print(test->log, "%*s\"interval_ms\": %u,\n", __indent(3U), test->opt.interval_ms);
  sl_iperf_log_print(test->log, "%*s\"bw_format\": \"%s\"\n", __indent(3U), sl_iperf_opt_bw_format_to_str(test->opt.bw_format));
  sl_iperf_log_print(test->log, "%*s},\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s\"statistic\": {\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s\"nbr_calls\":             %lu,\n", __indent(3U), test->statistic.nbr_calls);
  sl_iperf_log_print(test->log, "%*s\"bytes\":                 %lu,\n", __indent(3U), test->statistic.bytes);
  sl_iperf_log_print(test->log, "%*s\"tot_packets\":           %lu,\n", __indent(3U), test->statistic.tot_packets);
  sl_iperf_log_print(test->log, "%*s\"nbr_rcv_snt_packets\":   %lu,\n", __indent(3U), test->statistic.nbr_rcv_snt_packets);
  sl_iperf_log_print(test->log, "%*s\"errs\":                  %lu,\n", __indent(3U), test->statistic.errs);
  sl_iperf_log_print(test->log, "%*s\"transitory_error_cnts\": %lu,\n", __indent(3U), test->statistic.transitory_error_cnts);
  sl_iperf_log_print(test->log, "%*s\"last_recv_pkt_cnt\":     %lu,\n", __indent(3U), test->statistic.last_recv_pkt_cnt);
  sl_iperf_log_print(test->log, "%*s\"ts_curr_recv_ms\":       %lu,\n", __indent(3U), test->statistic.ts_curr_recv_ms);
  sl_iperf_log_print(test->log, "%*s\"ts_prev_recv_ms\":       %lu,\n", __indent(3U), test->statistic.ts_prev_recv_ms);
  sl_iperf_log_print(test->log, "%*s\"ts_curr_sent_ms\":       %lu,\n", __indent(3U), test->statistic.ts_curr_sent_ms);
  sl_iperf_log_print(test->log, "%*s\"ts_prev_sent_ms\":       %lu,\n", __indent(3U), test->statistic.ts_prev_sent_ms);
  sl_iperf_log_print(test->log, "%*s\"udp_jitter\":            %lld,\n", __indent(3U), test->statistic.udp_jitter);
  sl_iperf_log_print(test->log, "%*s\"udp_rx_last_pkt\":       %ld,\n", __indent(3U), test->statistic.udp_rx_last_pkt);
  sl_iperf_log_print(test->log, "%*s\"udp_lost_pkt\":          %lu,\n", __indent(3U), test->statistic.udp_lost_pkt);
  sl_iperf_log_print(test->log, "%*s\"udp_out_of_order\":      %lu,\n", __indent(3U), test->statistic.udp_out_of_order);
  sl_iperf_log_print(test->log, "%*s\"udp_dup_pkt\":           %lu,\n", __indent(3U), test->statistic.udp_dup_pkt);
  sl_iperf_log_print(test->log, "%*s\"udp_async_error\":       %s,\n", __indent(3U), _bool_to_json(test->statistic.udp_async_error));
  sl_iperf_log_print(test->log, "%*s\"end_err\":               %s,\n", __indent(3U), _bool_to_json(test->statistic.end_err));
  sl_iperf_log_print(test->log, "%*s\"ts_start_ms\":           %lu,\n", __indent(3U), test->statistic.ts_start_ms);
  sl_iperf_log_print(test->log, "%*s\"ts_end_ms\":             %lu,\n", __indent(3U), test->statistic.ts_end_ms);
  sl_iperf_log_print(test->log, "%*s\"bandwidth\":             %lu,\n", __indent(3U), test->statistic.bandwidth);
  sl_iperf_log_print(test->log, "%*s\"finack_tot_len\":        %lu,\n", __indent(3U), test->statistic.finack_tot_len);
  sl_iperf_log_print(test->log, "%*s\"finack_duration_ms\":    %lu,\n", __indent(3U), test->statistic.finack_duration_ms);
  sl_iperf_log_print(test->log, "%*s\"finack_pkt\":            %lu\n", __indent(3U), test->statistic.finack_pkt);
  sl_iperf_log_print(test->log, "%*s}\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s}\n", __indent(1U));
  sl_iperf_log_print(test->log, "}\n");
}

const char * sl_iperf_test_status_to_str(const sl_iperf_status_t status)
{
  switch (status) {
    case SL_IPERF_TEST_STATUS_FREE:      return "FREE";
    case SL_IPERF_TEST_STATUS_QUEUED:    return "QUEUED";
    case SL_IPERF_TEST_STATUS_RUNNING:   return "RUNNING";
    case SL_IPERF_TEST_STATUS_DONE:      return "DONE";
    case SL_IPERF_TEST_STATUS_ERR:       return "ERROR";
    default:                             return SL_IPERF_LOG_NOT_VALID_STR;
  }
}

const char * sl_iperf_test_error_to_str(const sl_iperf_error_t error)
{
  switch (error) {
    case SL_IPERF_ERR_NONE:                   return "NONE";
    case SL_IPERF_ERR_NETWORK_CONNECTION:     return "NETWORK_CONNECTION";
    case SL_IPERF_ERR_SERVER_SOCK_BIND:       return "SERVER_SOCK_BIND";
    case SL_IPERF_ERR_SERVER_SOCK_OPEN:       return "SERVER_SOCK_OPEN";
    case SL_IPERF_ERR_SERVER_SOCK_CLOSE:      return "SERVER_SOCK_CLOSE";
    case SL_IPERF_ERR_SERVER_SOCK_LISTEN:     return "SERVER_SOCK_LISTEN";
    case SL_IPERF_ERR_SERVER_SOCK_ACCEPT:     return "SERVER_SOCK_ACCEPT";
    case SL_IPERF_ERR_SERVER_SOCK_RX:         return "SERVER_SOCK_RX";
    case SL_IPERF_ERR_SERVER_SOCK_WIN_SIZE:   return "SERVER_SOCK_WIN_SIZE";
    case SL_IPERF_ERR_CLIENT_SOCK_OPEN:       return "CLIENT_SOCK_OPEN";
    case SL_IPERF_ERR_CLIENT_SOCK_BIND:       return "CLIENT_SOCK_BIND";
    case SL_IPERF_ERR_CLIENT_SOCK_CONN:       return "CLIENT_SOCK_CONN";
    case SL_IPERF_ERR_CLIENT_SOCK_TX:         return "CLIENT_SOCK_TX";
    case SL_IPERF_ERR_CLIENT_SOCK_TX_INV_ARG: return "CLIENT_SOCK_TX_INV_ARG";
    case SL_IPERF_ERR_CLIENT_SOCK_CLOSE:      return "CLIENT_SOCK_CLOSE";
    default:                                  return SL_IPERF_LOG_NOT_VALID_STR;
  }
}

const char * sl_iperf_opt_mode_to_str(const sl_iperf_mode_t mode)
{
  switch (mode) {
    case SL_IPERF_MODE_SERVER:   return "SERVER";
    case SL_IPERF_MODE_CLIENT:   return "CLIENT";
    default:                     return SL_IPERF_LOG_NOT_VALID_STR;
  }
}

const char * sl_iperf_opt_protocol_to_str(const sl_iperf_protocol_t protocol)
{
  switch (protocol) {
    case SL_IPERF_IPROTOV6_UDP:  return "IPV6_UDP";
    case SL_IPERF_IPROTOV6_TCP:  return "IPV6_TCP";
    case SL_IPERF_IPROTOV4_UDP:  return "IPV4_UDP";
    case SL_IPERF_IPROTOV4_TCP:  return "IPV4_TCP";
    default:                     return SL_IPERF_LOG_NOT_VALID_STR;
  }
}

int32_t sl_iperf_i32_change_byte_order(const int32_t i32val)
{
  i32_converter_t conv = { .i32val = i32val };

