espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/wisun/component/iperf/sl_iperf_util.c
  return (  (int32_t) conv.bytes[3U] << 0U)
         | ((int32_t) conv.bytes[2U] << 8U)
         | ((int32_t) conv.bytes[1U] << 16U)
         | ((int32_t) conv.bytes[0U] << 24U);
}

int16_t sl_iperf_i16_change_byte_order(const int16_t i16val)
{
  i16_converter_t conv = { .i16val = i16val };
  return ((int16_t) conv.bytes[1] << 0) | ((int16_t) conv.bytes[0] << 8);
}

#if SL_IPERF_VERBOSE_MODE

void sl_iper_test_dump_buff(sl_iperf_test_t * const test, const size_t size)
{
  uint8_t *buff    = NULL;
  size_t buff_size = 0U;
  uint8_t cnt      = 0U;

  if (!sl_iperf_check_test_logger(test) || !size) {
    return;
  }

  buff = test->conn.buff;
  buff_size = size > test->conn.buff_size ? test->conn.buff_size : size;

  sl_iperf_log_print(test->log, "--- Test-%lu buffer: %lu bytes ---\n", test->id, buff_size);
  for (size_t i = 0U; i < buff_size; ++i) {
    sl_iperf_log_print(test->log, "0x%.2x%s", buff[i], i == (buff_size - 1) ? "" : ", ");
    if (cnt == 9U) {
      printf("\n");
      cnt = 0U;
    } else {
      cnt++;
    }
  }
  sl_iperf_log_print(test->log, "\n");
  sl_iperf_log_print(test->log, "--- End buffer ---\n");
}

void sl_iperf_print_test_srv_header_json(sl_iperf_test_t * const test, const sl_iperf_udp_srv_hdr_t * const hdr)
{
  if (!sl_iperf_check_test_logger(test) || hdr == NULL) {
    return;
  }
  sl_iperf_log_print(test->log, "{\n");
  sl_iperf_log_print(test->log, "%*s\"Test-%lu-Srv\": {\n", __indent(1U), test->id);
  sl_iperf_log_print(test->log, "%*s\"dtg\": {\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s\"id\":            %ld,\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->dtg.id));
  sl_iperf_log_print(test->log, "%*s\"time_var_sec\":  %lu,\n", __indent(3U), sl_iperf_network_ntohl(hdr->dtg.time_var_sec));
  sl_iperf_log_print(test->log, "%*s\"time_var_usec\": %lu,\n", __indent(3U), sl_iperf_network_ntohl(hdr->dtg.time_var_usec));
  sl_iperf_log_print(test->log, "%*s\"id2\":           %ld\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->dtg.id2));
  sl_iperf_log_print(test->log, "%*s},\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s\"flags\":            %ld,\n", __indent(2U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->flags));
  sl_iperf_log_print(test->log, "%*s\"tot_len_u\":        %lu,\n", __indent(2U), sl_iperf_network_ntohl(hdr->tot_len_u));
  sl_iperf_log_print(test->log, "%*s\"tot_len_l\":        %lu,\n", __indent(2U), sl_iperf_network_ntohl(hdr->tot_len_l));
  sl_iperf_log_print(test->log, "%*s\"stop_sec\":         %lu,\n", __indent(2U), sl_iperf_network_ntohl(hdr->stop_sec));
  sl_iperf_log_print(test->log, "%*s\"stop_usec\":        %lu,\n", __indent(2U), sl_iperf_network_ntohl(hdr->stop_usec));
  sl_iperf_log_print(test->log, "%*s\"lost_pkt_cnt\":     %lu,\n", __indent(2U), sl_iperf_network_ntohl(hdr->lost_pkt_cnt));
  sl_iperf_log_print(test->log, "%*s\"out_of_order_cnt\": %lu,\n", __indent(2U), sl_iperf_network_ntohl(hdr->out_of_order_cnt));
  sl_iperf_log_print(test->log, "%*s\"packet_cnt\":       %lu,\n", __indent(2U), sl_iperf_network_ntohl(hdr->packet_cnt));
  sl_iperf_log_print(test->log, "%*s\"jitter_sec\":       %lu,\n", __indent(2U), sl_iperf_network_ntohl(hdr->jitter_sec));
  sl_iperf_log_print(test->log, "%*s\"jitter_usec\":      %lu\n", __indent(2U), sl_iperf_network_ntohl(hdr->jitter_usec));
  sl_iperf_log_print(test->log, "%*s}\n", __indent(1U));
  sl_iperf_log_print(test->log, "}\n");
}

void sl_iperf_print_test_clnt_header_json(sl_iperf_test_t * const test, const sl_iperf_udp_clnt_hdr_t * const hdr)
{
  if (!sl_iperf_check_test_logger(test) || hdr == NULL) {
    return;
  }
  sl_iperf_log_print(test->log, "{\n");
  sl_iperf_log_print(test->log, "%*s\"Test-%lu-Clnt\": {\n", __indent(1U), test->id);
  sl_iperf_log_print(test->log, "%*s\"dtg\": {\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s\"id\":            %ld,\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->dtg.id));
  sl_iperf_log_print(test->log, "%*s\"time_var_sec\":  %lu,\n", __indent(3U), sl_iperf_network_ntohl(hdr->dtg.time_var_sec));
  sl_iperf_log_print(test->log, "%*s\"time_var_usec\": %lu,\n", __indent(3U), sl_iperf_network_ntohl(hdr->dtg.time_var_usec));
  sl_iperf_log_print(test->log, "%*s\"id2\":           %ld\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->dtg.id2));
  sl_iperf_log_print(test->log, "%*s},\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s\"base\": {\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s\"flags\":       %ld,\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->base.flags));
  sl_iperf_log_print(test->log, "%*s\"num_threads\": %ld,\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->base.num_threads));
  sl_iperf_log_print(test->log, "%*s\"port\":        %ld,\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->base.port));
  sl_iperf_log_print(test->log, "%*s\"buf_len\":     %ld,\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->base.buf_len));
  sl_iperf_log_print(test->log, "%*s\"win_band\":    %ld,\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->base.win_band));
  sl_iperf_log_print(test->log, "%*s\"amount\":      %ld\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->base.amount));
  sl_iperf_log_print(test->log, "%*s},\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s\"extend\": {\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s\"type\":               %ld,\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->extend.type));
  sl_iperf_log_print(test->log, "%*s\"length\":             %ld,\n", __indent(3U), (int32_t) sl_iperf_network_ntohl((uint32_t)hdr->extend.length));
  sl_iperf_log_print(test->log, "%*s\"u_flags\":            %d,\n", __indent(3U), (int16_t) sl_iperf_network_ntohs((uint16_t)hdr->extend.u_flags));
  sl_iperf_log_print(test->log, "%*s\"l_flags\":            %d,\n", __indent(3U), (int16_t) sl_iperf_network_ntohs((uint16_t)hdr->extend.l_flags));
  sl_iperf_log_print(test->log, "%*s\"u_version\":          %lu,\n", __indent(3U), sl_iperf_network_ntohl(hdr->extend.u_version));
  sl_iperf_log_print(test->log, "%*s\"l_version\":          %lu,\n", __indent(3U), sl_iperf_network_ntohl(hdr->extend.l_version));
  sl_iperf_log_print(test->log, "%*s\"tos\":                %d,\n", __indent(3U), (int16_t) sl_iperf_network_ntohs((uint16_t)hdr->extend.tos));
  sl_iperf_log_print(test->log, "%*s\"l_rate\":             %lu,\n", __indent(3U), sl_iperf_network_ntohl(hdr->extend.l_rate));
  sl_iperf_log_print(test->log, "%*s\"u_rate\":             %lu,\n", __indent(3U), sl_iperf_network_ntohl(hdr->extend.u_rate));
  sl_iperf_log_print(test->log, "%*s\"tcp_write_prefetch\": %lu\n", __indent(3U), sl_iperf_network_ntohl(hdr->extend.tcp_write_prefetch));
  sl_iperf_log_print(test->log, "%*s}\n", __indent(2U));
  sl_iperf_log_print(test->log, "%*s}\n", __indent(1U));
  sl_iperf_log_print(test->log, "}\n");
}
#endif

