espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/wisun/component/iperf/sl_iperf_util.c
const char * sl_iperf_opt_bw_format_to_str(const sl_iperf_opt_bw_format format)
{
  switch (format) {
    case SL_IPERF_OPT_BW_FORMAT_BITS_PER_SEC:   return "bits/s";
    case SL_IPERF_OPT_BW_FORMAT_KBITS_PER_SEC:  return "Kbits/s";
    case SL_IPERF_OPT_BW_FORMAT_MBITS_PER_SEC:  return "Mbits/s";
    case SL_IPERF_OPT_BW_FORMAT_GBITS_PER_SEC:  return "Gbits/s";
    case SL_IPERF_OPT_BW_FORMAT_BYTES_PER_SEC:  return "bytes/s";
    case SL_IPERF_OPT_BW_FORMAT_KBYTES_PER_SEC: return "Kbytes/s";
    case SL_IPERF_OPT_BW_FORMAT_MBYTES_PER_SEC: return "Mbytes/s";
    case SL_IPERF_OPT_BW_FORMAT_GBYTES_PER_SEC: return "Gbytes/s";
    default:                                    return SL_IPERF_LOG_NOT_VALID_STR;
  }
}

uint32_t sl_iperf_formatted_bandwidth_from_bytes(const sl_iperf_opt_bw_format format, const uint32_t amount_bytes)
{
  switch (format) {
    case SL_IPERF_OPT_BW_FORMAT_BITS_PER_SEC:
      return amount_bytes * SL_IPERF_DATA_BYTE_TO_BIT_ML;
    case SL_IPERF_OPT_BW_FORMAT_KBITS_PER_SEC:
      return amount_bytes * SL_IPERF_DATA_BYTE_TO_BIT_ML / SL_IPERF_DATA_KBIT_TO_BIT_ML;
    case SL_IPERF_OPT_BW_FORMAT_MBITS_PER_SEC:
      return amount_bytes * SL_IPERF_DATA_BYTE_TO_BIT_ML / SL_IPERF_DATA_MBIT_TO_BIT_ML;
    case SL_IPERF_OPT_BW_FORMAT_GBITS_PER_SEC:
      return amount_bytes * SL_IPERF_DATA_BYTE_TO_BIT_ML / SL_IPERF_DATA_GBIT_TO_BIT_ML;
    case SL_IPERF_OPT_BW_FORMAT_BYTES_PER_SEC:
      return amount_bytes;
    case SL_IPERF_OPT_BW_FORMAT_KBYTES_PER_SEC:
      return amount_bytes / SL_IPERF_DATA_KBYTE_TO_BYTE_ML;
    case SL_IPERF_OPT_BW_FORMAT_MBYTES_PER_SEC:
      return amount_bytes / SL_IPERF_DATA_MBYTE_TO_BYTE_ML;
    case SL_IPERF_OPT_BW_FORMAT_GBYTES_PER_SEC:
      return amount_bytes / SL_IPERF_DATA_GBYTE_TO_BYTE_ML;
    default:
      return 0LU;
  }
}

#if 1
uint32_t sl_iperf_bytes_from_formatted_bandwidth(const sl_iperf_opt_bw_format format, const uint32_t amount_bandwidth)
{
  switch (format) {
    case SL_IPERF_OPT_BW_FORMAT_BITS_PER_SEC:
      return amount_bandwidth / SL_IPERF_DATA_BYTE_TO_BIT_ML;
    case SL_IPERF_OPT_BW_FORMAT_KBITS_PER_SEC:
      return amount_bandwidth / SL_IPERF_DATA_BYTE_TO_BIT_ML * SL_IPERF_DATA_KBIT_TO_BIT_ML;
    case SL_IPERF_OPT_BW_FORMAT_MBITS_PER_SEC:
      return amount_bandwidth / SL_IPERF_DATA_BYTE_TO_BIT_ML * SL_IPERF_DATA_MBIT_TO_BIT_ML;
    case SL_IPERF_OPT_BW_FORMAT_GBITS_PER_SEC:
      return amount_bandwidth / SL_IPERF_DATA_BYTE_TO_BIT_ML * SL_IPERF_DATA_GBIT_TO_BIT_ML;
    case SL_IPERF_OPT_BW_FORMAT_BYTES_PER_SEC:
      return amount_bandwidth;
    case SL_IPERF_OPT_BW_FORMAT_KBYTES_PER_SEC:
      return amount_bandwidth * SL_IPERF_DATA_KBYTE_TO_BYTE_ML;
    case SL_IPERF_OPT_BW_FORMAT_MBYTES_PER_SEC:
      return amount_bandwidth * SL_IPERF_DATA_MBYTE_TO_BYTE_ML;
    case SL_IPERF_OPT_BW_FORMAT_GBYTES_PER_SEC:
      return amount_bandwidth * SL_IPERF_DATA_GBYTE_TO_BYTE_ML;
    default:
      return 0LU;
  }
}
#endif

void sl_iperf_test_fill_buffer_with_pattern(sl_iperf_test_t * const test)
{
  char patt = '0';

  if (test == NULL || test->conn.buff == NULL) {
    return;
  }

  for (size_t i = 0U; i < test->conn.buff_size; ++i) {
    if (patt > '9') {
      patt = '0';
    }
    test->conn.buff[i] = patt++;
  }
}

void sl_iperf_test_print_udp_conn_str(sl_iperf_test_t * const test)
{
  static char clnt_ip_str[SL_IPERF_IP_STR_BUFF_LEN] = { 0U };
  static char srv_ip_str[SL_IPERF_IP_STR_BUFF_LEN]  = { 0U };

  sl_iperf_inet_ntop(&test->conn.clnt_addr, clnt_ip_str, sizeof(clnt_ip_str));
  sl_iperf_inet_ntop(&test->conn.srv_addr, srv_ip_str, sizeof(srv_ip_str));
  if (test->opt.mode == SL_IPERF_MODE_SERVER) {
    sl_iperf_test_log(test, SL_IPERF_UDP_SRV_CONNECTION_FORMAT_STR,
                      srv_ip_str,
                      sl_iperf_get_socket_addr_port(&test->conn.srv_addr),
                      clnt_ip_str,
                      sl_iperf_get_socket_addr_port(&test->conn.clnt_addr));
  } else {
    sl_iperf_test_log(test, SL_IPERF_UDP_CLNT_CONNECTION_FORMAT_STR,
                      clnt_ip_str,
                      srv_ip_str,
                      sl_iperf_get_socket_addr_port(&test->conn.srv_addr));
  }
}

void sl_iperf_test_update_status(sl_iperf_test_t * const test)
{
  static sl_iperf_ts_ms_t ts_ms_prev     =   0UL;
  static size_t data_bytes_prev          =   0UL;
  static sl_iperf_ts_ms_t update_time_ms =   0UL;
  static uint32_t lost_pkt_prev          =   0UL;
  static uint32_t out_of_order_pkt_prev  =   0UL;
  stat_update_params_t params            = { 0UL };

  // init previous status if test started
  if (test->statistic.nbr_rcv_snt_packets <= 1U) {
    ts_ms_prev = test->opt.mode == SL_IPERF_MODE_SERVER ? test->statistic.ts_curr_recv_ms : test->statistic.ts_curr_sent_ms;
    data_bytes_prev = test->statistic.bytes;
    update_time_ms = 0U;
    lost_pkt_prev = 0U;
    out_of_order_pkt_prev = 0UL;
    return;
  }

  // update if interval is set
  if (!test->opt.interval_ms) {
    return;
  }

  // Elapsed time calculation
  if (test->statistic.ts_end_ms) {
    ts_ms_prev = test->statistic.ts_start_ms;
    params.ts_ms_cur = test->statistic.ts_end_ms;
    params.data_bytes_delta = test->statistic.bytes;
  } else {
    params.data_bytes_cur = test->statistic.bytes;
    params.data_bytes_delta = params.data_bytes_cur - data_bytes_prev;
    params.ts_ms_cur = sl_iperf_get_timestamp_ms();
  }

  params.ts_ms_delta = (sl_iperf_ts_ms_t) (params.ts_ms_cur - ts_ms_prev);
  // Prevent division by zero
  if (!params.ts_ms_delta) {
    return;
  }

  if (params.ts_ms_delta >= test->opt.interval_ms) {
    ts_ms_prev = params.ts_ms_cur;
    data_bytes_prev = params.data_bytes_cur;
    sl_iperf_calc_time_from_ms(&params.start_time, update_time_ms);
    update_time_ms += params.ts_ms_delta;
    sl_iperf_calc_time_from_ms(&params.end_time, update_time_ms);

    _calculate_formatted_bw(test->opt.bw_format, params.data_bytes_delta, params.ts_ms_delta, &params.fval_bw);
    _data_converter(params.data_bytes_delta, SL_IPERF_DATA_KBYTE_TO_BYTE_ML, &params.fval_data);

    if (sl_iperf_test_is_udp_srv(test)) {
      params.out_of_order_pkt_cnt = test->statistic.udp_out_of_order - out_of_order_pkt_prev;
      out_of_order_pkt_prev = test->statistic.udp_out_of_order;
      params.lost_pkt_curr = test->statistic.udp_lost_pkt - lost_pkt_prev;
      lost_pkt_prev = test->statistic.udp_lost_pkt;
      params.pkt_cnt = test->statistic.last_recv_pkt_cnt + params.lost_pkt_curr;
      // reset when update it 
      test->statistic.last_recv_pkt_cnt = 0UL;
      
      _print_udp_srv_status(test, &params);
    } else if (sl_iperf_test_is_udp_clnt(test)) {
      _print_udp_clnt_status(test, &params);
    } else if (sl_iperf_test_is_tcp_srv(test)) {
      (void) 0U;
    } else if (sl_iperf_test_is_tcp_clnt(test)) {
      (void) 0U;
    }
  }
}

