espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/wisun/component/iperf/sl_iperf_util.c
void sl_iperf_test_print_udp_srv_report_hdr(sl_iperf_test_t * const test)
{
  sl_iperf_test_log(test, SL_IPERF_SERVER_REPORT_HEADER);
}

void sl_iperf_test_print_udp_clnt_report_hdr(sl_iperf_test_t * const test)
{
  sl_iperf_test_log(test, SL_IPERF_CLIENT_REPORT_HEADER);
}

void sl_iperf_test_calculate_average_bandwidth(sl_iperf_test_t * const test)
{
  stat_update_params_t params       = { 0UL };
  sl_iperf_ts_ms_t time_duration_ms =   0UL;

  time_duration_ms = sl_iperf_test_calc_time_duration_ms(test);

  _calculate_formatted_bw(test->opt.bw_format,
                          test->statistic.bytes,
                          time_duration_ms,
                          &params.fval_bw);

  _data_converter(test->statistic.bytes,
                  SL_IPERF_DATA_KBYTE_TO_BYTE_ML,
                  &params.fval_data);
  if (time_duration_ms) {
    // calculate bandwidth for statistic in bits/sec
    test->statistic.bandwidth = (uint32_t)(((uint64_t)test->statistic.bytes * SL_IPERF_DATA_BYTE_TO_BIT_ML * 
                              SL_IPERF_TIME_S_TO_MS_ML) / time_duration_ms);
  } else {
    test->statistic.bandwidth = 0UL;
  }
  
  sl_iperf_calc_time_from_ms(&params.end_time, time_duration_ms);
  params.pkt_cnt = test->statistic.tot_packets;
  params.lost_pkt_curr = test->statistic.udp_lost_pkt;
  params.start_time.sec  = 0UL;
  params.start_time.usec = 0UL;

  // sl_iperf_test_log(test, "  ---\n");
  if (sl_iperf_test_is_udp_srv(test)) {
    _print_udp_srv_status(test, &params);
  } else if (sl_iperf_test_is_udp_clnt(test)) {
    // print client report
    _print_udp_clnt_status(test, &params);
    sl_iperf_test_log(test, " Sent %lu datagrams\n", test->statistic.nbr_rcv_snt_packets);

    // print server report
    sl_iperf_test_log(test, " Server Report:\n");
    _calculate_formatted_bw(test->opt.bw_format,
                            test->statistic.finack_tot_len,
                            test->statistic.finack_duration_ms,
                            &params.fval_bw);

    _data_converter(test->statistic.finack_tot_len,
                    SL_IPERF_DATA_KBYTE_TO_BYTE_ML,
                    &params.fval_data);

    sl_iperf_calc_time_from_ms(&params.end_time, test->statistic.finack_duration_ms);
    params.pkt_cnt = test->statistic.finack_pkt;
    params.out_of_order_pkt_cnt = test->statistic.udp_out_of_order;
    sl_iperf_test_print_udp_srv_report_hdr(test);
    _print_udp_srv_status(test, &params);
  } else if (sl_iperf_test_is_tcp_srv(test)) {
    (void) 0U;
  } else if (sl_iperf_test_is_tcp_clnt(test)) {
    (void) 0U;
  }
}

// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------

static inline const char *_bool_to_json(const bool val)
{
  return val ? "true" : "false";
}

static void _data_converter(const uint32_t amount, const uint32_t divider, ifloat_t * const dst)
{
  uint32_t rem = 0UL;

  if (!divider) {
    return;
  }

  // 3 points precision
  dst->int_val = amount / divider;
  rem = amount - dst->int_val * divider;
  dst->f0_val = ((rem * 10) / divider) % 10;
  dst->f1_val = ((rem * 100) / divider) % 10;
  dst->f2_val = ((rem * 1000) / divider) % 10;
}

static void _calculate_formatted_bw(const sl_iperf_opt_bw_format bw_format,
                                    const uint32_t bytes,
                                    const uint32_t time_ms,
                                    ifloat_t * const res)
{
  uint32_t byteps_val = 0UL;
  uint32_t bitps_val  = 0UL;

  // reset res
  memset(res, 0U, sizeof(ifloat_t));
  
  if (!time_ms) {
    return;
  }

  byteps_val = (bytes * SL_IPERF_TIME_S_TO_MS_ML) / time_ms;
  bitps_val = (byteps_val * SL_IPERF_DATA_BYTE_TO_BIT_ML);

  switch (bw_format) {
    case SL_IPERF_OPT_BW_FORMAT_BITS_PER_SEC:
      res->int_val = bitps_val;
      res->f0_val = 0UL;
      res->f1_val = 0UL;
      res->f2_val = 0UL;
      break;

    case SL_IPERF_OPT_BW_FORMAT_KBITS_PER_SEC:
      _data_converter(bitps_val, SL_IPERF_DATA_KBIT_TO_BIT_ML, res);
      break;

    case SL_IPERF_OPT_BW_FORMAT_MBITS_PER_SEC:
      _data_converter(bitps_val, SL_IPERF_DATA_MBIT_TO_BIT_ML, res);
      break;

    case SL_IPERF_OPT_BW_FORMAT_GBITS_PER_SEC:
      _data_converter(bitps_val, SL_IPERF_DATA_GBIT_TO_BIT_ML, res);
      break;

    case SL_IPERF_OPT_BW_FORMAT_BYTES_PER_SEC:
      res->int_val = byteps_val;
      res->f0_val = 0UL;
      res->f1_val = 0UL;
      res->f2_val = 0UL;
      break;
    case SL_IPERF_OPT_BW_FORMAT_KBYTES_PER_SEC:
      _data_converter(byteps_val, SL_IPERF_DATA_KBYTE_TO_BYTE_ML, res);
      break;

    case SL_IPERF_OPT_BW_FORMAT_MBYTES_PER_SEC:
      _data_converter(byteps_val, SL_IPERF_DATA_MBYTE_TO_BYTE_ML, res);
      break;

    case SL_IPERF_OPT_BW_FORMAT_GBYTES_PER_SEC:
      _data_converter(byteps_val, SL_IPERF_DATA_KBYTE_TO_BYTE_ML, res);
      break;

    default:
      break;
  }
}

static inline uint8_t _calc_ind(const uint8_t val)
{
  return (uint8_t)(val * SL_IPERF_LOG_JSON_INDENT);
}

bool sl_iperf_test_check_time(const sl_iperf_ts_ms_t test_start_ts)
{
#if (0U < SL_IPERF_MAX_TEST_TIMEOUT_MS)
  return (bool)((sl_iperf_get_timestamp_ms() - test_start_ts) < SL_IPERF_MAX_TEST_TIMEOUT_MS);
#else
  return true;
#endif
}

bool sl_iperf_opt_bw_format_from_str(const char *str, sl_iperf_opt_bw_format * const bw_format)
{
  if (!strncmp(str, sl_iperf_opt_bw_format_to_str(SL_IPERF_OPT_BW_FORMAT_BITS_PER_SEC),
               SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *bw_format = SL_IPERF_OPT_BW_FORMAT_BITS_PER_SEC;
  } else if (!strncmp(str, sl_iperf_opt_bw_format_to_str(SL_IPERF_OPT_BW_FORMAT_KBITS_PER_SEC),
                      SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *bw_format = SL_IPERF_OPT_BW_FORMAT_KBITS_PER_SEC;
  } else if (!strncmp(str, sl_iperf_opt_bw_format_to_str(SL_IPERF_OPT_BW_FORMAT_MBITS_PER_SEC),
                      SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *bw_format = SL_IPERF_OPT_BW_FORMAT_MBITS_PER_SEC;
  } else if (!strncmp(str, sl_iperf_opt_bw_format_to_str(SL_IPERF_OPT_BW_FORMAT_GBITS_PER_SEC),
                      SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *bw_format = SL_IPERF_OPT_BW_FORMAT_GBITS_PER_SEC;
  } else if (!strncmp(str, sl_iperf_opt_bw_format_to_str(SL_IPERF_OPT_BW_FORMAT_BYTES_PER_SEC),
                      SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *bw_format = SL_IPERF_OPT_BW_FORMAT_BYTES_PER_SEC;
  } else if (!strncmp(str, sl_iperf_opt_bw_format_to_str(SL_IPERF_OPT_BW_FORMAT_KBYTES_PER_SEC),
                      SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *bw_format = SL_IPERF_OPT_BW_FORMAT_KBYTES_PER_SEC;
  } else if (!strncmp(str, sl_iperf_opt_bw_format_to_str(SL_IPERF_OPT_BW_FORMAT_MBYTES_PER_SEC),
                      SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *bw_format = SL_IPERF_OPT_BW_FORMAT_MBYTES_PER_SEC;
  } else if (!strncmp(str, sl_iperf_opt_bw_format_to_str(SL_IPERF_OPT_BW_FORMAT_GBYTES_PER_SEC),
                      SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *bw_format = SL_IPERF_OPT_BW_FORMAT_GBYTES_PER_SEC;
  } else {
    return false;
  }
  return true;
}

bool sl_iperf_opt_protocol_from_str(const char *str, sl_iperf_protocol_t * const dest_protocol)
{
  if (!strncmp(str, sl_iperf_opt_protocol_to_str(SL_IPERF_IPROTOV6_UDP),
               SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *dest_protocol = SL_IPERF_IPROTOV6_UDP;
  } else if (!strncmp(str, sl_iperf_opt_protocol_to_str(SL_IPERF_IPROTOV6_TCP),
                      SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *dest_protocol = SL_IPERF_IPROTOV6_TCP;
  } else if (!strncmp(str, sl_iperf_opt_protocol_to_str(SL_IPERF_IPROTOV4_UDP),
                      SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *dest_protocol = SL_IPERF_IPROTOV4_UDP;
  } else if (!strncmp(str, sl_iperf_opt_protocol_to_str(SL_IPERF_IPROTOV4_TCP),
                      SL_IPERF_UTIL_MAX_STRING_LENGTH)) {
    *dest_protocol = SL_IPERF_IPROTOV4_TCP;
  } else {
    return false;
  }
  return true;
}

static void _print_udp_srv_status(sl_iperf_test_t * const test,
                                  const stat_update_params_t * const params)
{
  sl_iperf_test_log(test, SL_IPERF_UDP_SRV_STATISTIC_FORMAT_STR,
                    params->start_time.sec,
                    params->start_time.usec / 10000UL,
                    params->end_time.sec,
                    params->end_time.usec / 10000UL,
                    params->fval_data.int_val,
                    params->fval_data.f0_val,
                    params->fval_data.f1_val,
                    params->fval_data.f2_val,
                    "Kbytes",
                    params->fval_bw.int_val,
                    params->fval_bw.f0_val,
                    params->fval_bw.f1_val,
                    params->fval_bw.f2_val,
                    sl_iperf_opt_bw_format_to_str(test->opt.bw_format),
                    (uint32_t)test->statistic.udp_jitter,
                    params->lost_pkt_curr,
                    params->pkt_cnt,
                    params->pkt_cnt ? (params->lost_pkt_curr * 100UL) / params->pkt_cnt : 0UL);
  if (params->out_of_order_pkt_cnt) {
    sl_iperf_test_log(test, SL_IPERF_UDP_SRV_OUT_OF_ORDER_STAT_FORMAT_STR,
                      params->start_time.sec,
                      params->start_time.usec / 10000UL,
                      params->end_time.sec,
                      params->end_time.usec / 10000UL,
                      params->out_of_order_pkt_cnt);
  }
}

static void _print_udp_clnt_status(sl_iperf_test_t * const test,
                                   const stat_update_params_t * const params)
{
  sl_iperf_test_log(test, SL_IPERF_UDP_CLNT_STATISTIC_FORMAT_STR,
                    params->start_time.sec,
                    params->start_time.usec / 10000UL,
                    params->end_time.sec,
                    params->end_time.usec / 10000UL,
                    params->fval_data.int_val,
                    params->fval_data.f0_val,
                    params->fval_data.f1_val,
                    params->fval_data.f2_val,
                    "Kbytes",
                    params->fval_bw.int_val,
                    params->fval_bw.f0_val,
                    params->fval_bw.f1_val,
                    params->fval_bw.f2_val,
                    sl_iperf_opt_bw_format_to_str(test->opt.bw_format));
}
